<?php
$phone = get_field('phone', 'option');
$phone_clean = $phone ? preg_replace('/[^\d+]/', '', $phone) : '';
$email = get_field('email', 'option');
$address = get_field('address', 'option');
$company_name = get_field('company_name', 'option');
$post_index_number = get_field('post_index_number', 'option');
$inn_number = get_field('inn_number', 'option');
$kpp_number = get_field('kpp_number', 'option');
$ogrn_number = get_field('ogrn_number', 'option');
?>

</main>

<footer class="footer">
    <div class="footer__top">
        <div class="footer__top-container container">
            <div class="footer__column">
                <h4 class="footer__caption">Частным лицам</h4>
                <ul class="footer__menu-list">
                    <li><a href="#">Уборка после потопа</a></li>
                    <li><a href="#">Дезинфекция помещений</a></li>
                    <li><a href="#">Просушка квартир и домов</a></li>
                    <li><a href="#">Уборка после пожара</a></li>
                    <li><a href="#">Уборка после смерти</a></li>
                    <li><a href="#">Выведение неприятных запахов</a></li>
                    <li><a href="#">Уборка сильно загрязнённых квартир</a></li>
                </ul>
            </div>

            <div class="footer__column">
                <h4 class="footer__caption">Компаниям</h4>
                <ul class="footer__menu-list">
                    <li><a href="#">Очистка производственных помещений</a></li>
                    <li><a href="#">Уборка после пожара на объектах</a></li>
                    <li><a href="#">Осушение помещений</a></li>
                    <li><a href="#">Обработка от плесени</a></li>
                    <li><a href="#">Дезинфекция помещений</a></li>
                    <li><a href="#">Озонирование</a></li>
                    <li><a href="#">Уборка складских помещений</a></li>
                </ul>
            </div>


            <div class="footer__column">
                <h4 class="footer__caption">Навигация</h4>
                <nav class="footer__menu" aria-label="Меню навигации в подвале">
                    <?php
                    wp_nav_menu([
                        'theme_location' => 'footer_navigation_menu',
                        'container'      => false,
                        'menu_class'     => 'footer__menu-list',
                        'items_wrap'     => '<ul id="%1$s" class="%2$s">%3$s</ul>',
                    ]);
                    ?>
                </nav>
            </div>


            <div class="footer__column footer__column--cta">
                <h4 class="footer__caption">Нужна оценка по вашему случаю?</h4>
                <p>Пришлите фото или опишите ситуацию <br>— скажем план работ и стоимость.</p>
                <div class="footer__btns">
                    <a href="#" class="btn btn-primary btn-footer">Отправить фото</a>
                    <a href="#" class="btn btn-outline-white btn-footer">Позвонить</a>
                </div>
            </div>
        </div>
    </div>
    <div class="footer__middle">
        <div class="footer__middle-container container">
            <div class="footer__middle-column">
                <h4 class="footer__caption">Компания</h4>
                <div class="footer__reqs">
                    <p>
                        <?php if ($company_name): ?>
                            <span class="text-uppercase"><?php echo $company_name; ?></span>
                        <?php endif; ?>
                        <br>
                        Клининг в сложных ситуациях <br>
                        в Санкт-Петербурге и Ленинградской области
                    </p>
                    <p>
                        Юридический и фактический адрес:
                        <?php if ($post_index_number): ?>
                            <?php echo $post_index_number; ?>,
                        <?php endif; ?>
                        <?php if ($address): ?>
                            <?php echo nl2br($address); ?>
                        <?php endif; ?>
                    </p>
                    <p>
                        <?php if ($inn_number): ?>
                            ИНН <?php echo $inn_number; ?><br>
                        <?php endif; ?>
                        <?php if ($kpp_number): ?>
                            КПП <?php echo $kpp_number; ?><br>
                        <?php endif; ?>
                        <?php if ($ogrn_number): ?>
                            ОГРН <?php echo $ogrn_number; ?><br>
                        <?php endif; ?>
                    </p>
                </div>
            </div>
            <div class="footer__middle-column">
                <h4 class="footer__caption">Полезная информация</h4>
                <nav aria-label="Меню информации в подвале">
                    <?php
                    wp_nav_menu([
                        'theme_location' => 'footer_information_menu',
                        'container'      => false,
                        'menu_class'     => 'footer__menu-list',
                        'items_wrap'     => '<ul id="%1$s" class="%2$s">%3$s</ul>',
                    ]);
                    ?>
                </nav>

                <h4 class="footer__caption">Мы в социальных сетях</h4>
                <?php if (have_rows('socials', 'option')): ?>
                    <div class="footer__socials socials">
                        <?php while (have_rows('socials', 'option')): the_row();
                            $icon = get_sub_field('icon');
                            $link = get_sub_field('link');

                            if ($link):
                                $link_url    = $link['url'];
                                $link_title  = !empty($link['title']) ? $link['title'] : false;
                                $link_target = $link['target'] ? $link['target'] : '_self';
                        ?>
                                <a href="<?php echo esc_url($link_url); ?>"
                                    class="socials__item"
                                    target="<?php echo esc_attr($link_target); ?>"
                                    <?php if ($link_title): ?>aria-label="<?php echo esc_attr($link_title); ?>" <?php endif; ?>>

                                    <?php if ($icon): ?>
                                        <img src="<?php echo esc_url($icon['url']); ?>" alt="<?php echo $icon['alt'] ?>">
                                    <?php endif; ?>

                                </a>
                        <?php endif;
                        endwhile; ?>
                    </div>
                <?php endif; ?>
            </div>
            <div class="footer__middle-column">
                <h4 class="footer__caption">Контакты</h4>
                <ul class="footer__contacts">
                    <?php if ($phone): ?>
                        <li class="footer__contacts-item icon-phone-fill">
                            <a href="tel:<?php echo $phone_clean; ?>"
                                class="footer__contacts-link">
                                <?php echo $phone; ?>
                            </a>
                        </li>
                    <?php endif; ?>

                    <?php if ($email): ?>
                        <li class="footer__contacts-item icon-envelope-fill">
                            <a href="mailto:<?php echo antispambot($email); ?>"><?php echo antispambot($email); ?></a>
                        </li>
                    <?php endif; ?>

                    <?php if ($address): ?>
                        <li class="footer__contacts-item icon-location">
                            <address><?php echo nl2br($address); ?></address>
                        </li>
                    <?php endif; ?>
                </ul>
                <h4 class="footer__caption">Способы оплаты</h4>
                <div class="footer__payments">
                    <svg class="pay-icon" width="40" height="12" viewBox="0 0 40 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M15.1867 0.213651L9.95 11.8189H6.53333L3.95667 2.55606C3.8 1.98632 3.665 1.77732 3.18833 1.53735C2.41167 1.14566 1.12833 0.778739 0 0.549607L0.0766667 0.213651H5.57667C5.93608 0.213316 6.28378 0.332342 6.55701 0.549243C6.83025 0.766144 7.011 1.06663 7.06667 1.39647L8.42833 8.1125L11.7917 0.213651H15.1867ZM28.575 8.03045C28.5883 4.96659 24.015 4.79783 24.0467 3.42923C24.0567 3.01277 24.4833 2.56999 25.4167 2.45697C26.5105 2.36048 27.6121 2.5402 28.605 2.97716L29.1717 0.515547C28.205 0.177732 27.1811 0.00313749 26.1483 0C22.9533 0 20.705 1.57915 20.685 3.83796C20.665 5.50845 22.29 6.43891 23.515 6.99626C24.775 7.56444 25.1983 7.92982 25.1917 8.43762C25.1833 9.21791 24.1883 9.56006 23.2583 9.57399C21.6333 9.59721 20.6917 9.16682 19.9383 8.8417L19.3533 11.3838C20.1083 11.7058 21.5017 11.9876 22.9467 12C26.3417 12 28.5633 10.4425 28.575 8.03045ZM37.01 11.8189H40L37.3917 0.213651H34.6317C34.3366 0.210475 34.0474 0.290041 33.8018 0.441952C33.5562 0.593863 33.3656 0.811057 33.255 1.06515L28.4067 11.8189H31.8L32.475 10.0849H36.6217L37.01 11.8189ZM33.405 7.70688L35.105 3.34873L36.085 7.70688H33.405ZM19.805 0.213651L17.1333 11.8189H13.9L16.575 0.213651H19.805Z" fill="#898989" />
                    </svg>

                    <svg width="40" height="31" viewBox="0 0 40 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_108_647)">
                            <path d="M7.27205 30.8459V28.7941C7.27205 28.0075 6.79174 27.4946 5.96846 27.4946C5.55689 27.4946 5.11096 27.6314 4.80221 28.076C4.56221 27.6998 4.21924 27.4946 3.70471 27.4946C3.36158 27.4946 3.01877 27.5971 2.74424 27.9733V27.563H2.02393V30.8459H2.74424V29.0334C2.74424 28.4522 3.05299 28.1785 3.5333 28.1785C4.0133 28.1785 4.25361 28.4863 4.25361 29.0334V30.8459H4.97393V29.0334C4.97393 28.4522 5.31674 28.1785 5.76268 28.1785C6.24299 28.1785 6.48299 28.4863 6.48299 29.0334V30.8459H7.27205ZM17.9394 27.563H16.7733V26.5713H16.053V27.563H15.4013V28.2126H16.0528V29.7174C16.0528 30.4699 16.3616 30.9143 17.1849 30.9143C17.4936 30.9143 17.8364 30.8118 18.0767 30.675L17.8708 30.0594C17.665 30.1962 17.425 30.2304 17.2535 30.2304C16.9105 30.2304 16.7733 30.0253 16.7733 29.6832V28.2126H17.9394V27.563ZM24.045 27.4945C23.6335 27.4945 23.3591 27.6998 23.1875 27.9733V27.563H22.4672V30.8459H23.1875V28.9993C23.1875 28.4522 23.4275 28.1444 23.8735 28.1444C24.0106 28.1444 24.1822 28.1787 24.3194 28.2128L24.5252 27.5289C24.388 27.4946 24.1822 27.4946 24.045 27.4946M14.8181 27.8367C14.475 27.5973 13.9949 27.4948 13.4803 27.4948C12.6572 27.4948 12.1085 27.9051 12.1085 28.5549C12.1085 29.1021 12.52 29.4098 13.2403 29.5124L13.5833 29.5467C13.9606 29.6149 14.1664 29.7176 14.1664 29.8886C14.1664 30.1279 13.8921 30.299 13.4117 30.299C12.9314 30.299 12.5542 30.1279 12.3141 29.957L11.9711 30.5041C12.3485 30.7777 12.863 30.9145 13.3774 30.9145C14.3378 30.9145 14.8867 30.47 14.8867 29.8544C14.8867 29.273 14.4408 28.9652 13.7547 28.8627L13.4117 28.8284C13.103 28.7941 12.863 28.7259 12.863 28.5208C12.863 28.2813 13.103 28.1445 13.4803 28.1445C13.8921 28.1445 14.3036 28.3154 14.5094 28.4181L14.8181 27.8367ZM33.958 27.4948C33.5463 27.4948 33.2719 27.7 33.1003 27.9735V27.5632H32.38V30.8461H33.1003V28.9995C33.1003 28.4524 33.3405 28.1445 33.7863 28.1445C33.9236 28.1445 34.0952 28.1788 34.2324 28.2129L34.4381 27.5291C34.301 27.4948 34.0952 27.4948 33.958 27.4948ZM24.7653 29.2046C24.7653 30.1963 25.4513 30.9145 26.5147 30.9145C26.9949 30.9145 27.3378 30.8119 27.6808 30.5384L27.3378 29.957C27.0635 30.1622 26.7891 30.2647 26.4803 30.2647C25.8972 30.2647 25.4856 29.8544 25.4856 29.2046C25.4856 28.5891 25.8972 28.1787 26.4803 28.1445C26.7891 28.1445 27.0635 28.247 27.3378 28.4524L27.6808 27.871C27.3378 27.5973 26.9949 27.4948 26.5147 27.4948C25.4513 27.4948 24.7653 28.2129 24.7653 29.2046ZM31.4197 29.2046V27.5632H30.6994V27.9735C30.4592 27.6658 30.1163 27.4948 29.6703 27.4948C28.7442 27.4948 28.0239 28.2129 28.0239 29.2046C28.0239 30.1963 28.7442 30.9145 29.6703 30.9145C30.1505 30.9145 30.4936 30.7436 30.6994 30.4357V30.8461H31.4197V29.2046ZM28.7785 29.2046C28.7785 28.6233 29.1558 28.1445 29.7731 28.1445C30.3563 28.1445 30.768 28.5891 30.768 29.2046C30.768 29.786 30.3563 30.2647 29.7731 30.2647C29.1558 30.2304 28.7785 29.786 28.7785 29.2046ZM20.1691 27.4948C19.2086 27.4948 18.5225 28.1787 18.5225 29.2046C18.5225 30.2306 19.2085 30.9145 20.2033 30.9145C20.6835 30.9145 21.1638 30.7777 21.5411 30.47L21.198 29.957C20.9236 30.1622 20.5806 30.299 20.2377 30.299C19.7917 30.299 19.3458 30.0938 19.2428 29.5123H21.6783V29.2389C21.7127 28.1787 21.0953 27.4948 20.1691 27.4948ZM20.1689 28.1103C20.6147 28.1103 20.9236 28.384 20.9921 28.897H19.2771C19.3456 28.4524 19.6544 28.1103 20.1689 28.1103ZM38.0396 29.2046V26.2637H37.3192V27.9735C37.0791 27.6658 36.7361 27.4948 36.2902 27.4948C35.3641 27.4948 34.6438 28.2129 34.6438 29.2046C34.6438 30.1963 35.3641 30.9145 36.2902 30.9145C36.7705 30.9145 37.1135 30.7436 37.3192 30.4357V30.8461H38.0396V29.2046ZM35.3985 29.2046C35.3985 28.6233 35.7756 28.1445 36.3931 28.1445C36.9763 28.1445 37.3878 28.5891 37.3878 29.2046C37.3878 29.786 36.9763 30.2647 36.3931 30.2647C35.7756 30.2304 35.3985 29.786 35.3985 29.2046ZM11.3192 29.2046V27.5632H10.5989V27.9735C10.3588 27.6658 10.0158 27.4948 9.56986 27.4948C8.64377 27.4948 7.92346 28.2129 7.92346 29.2046C7.92346 30.1963 8.64377 30.9145 9.56986 30.9145C10.0502 30.9145 10.3931 30.7436 10.5989 30.4357V30.8461H11.3192V29.2046ZM8.64377 29.2046C8.64377 28.6233 9.02111 28.1445 9.63846 28.1445C10.2216 28.1445 10.6333 28.5891 10.6333 29.2046C10.6333 29.786 10.2216 30.2647 9.63846 30.2647C9.02111 30.2304 8.64377 29.786 8.64377 29.2046Z" fill="#898989" />
                            <path d="M14.5776 2.63281H25.3823V21.9885H14.5776V2.63281Z" fill="#FF5F00" />
                            <path d="M15.2639 12.3111C15.2639 8.37841 17.1161 4.89021 19.963 2.63313C17.8708 0.991689 15.2297 0 12.3484 0C5.52234 0 0 5.50569 0 12.3111C0 19.1164 5.52234 24.6221 12.3483 24.6221C15.2295 24.6221 17.8706 23.6304 19.963 21.9888C17.1161 19.766 15.2639 16.2437 15.2639 12.3111Z" fill="#EB001B" />
                            <path d="M39.9605 12.3111C39.9605 19.1163 34.4382 24.6221 27.6122 24.6221C24.731 24.6221 22.0899 23.6304 19.9976 21.9888C22.8788 19.7319 24.6968 16.2437 24.6968 12.3111C24.6968 8.37841 22.8444 4.89021 19.9976 2.63313C22.0897 0.991689 24.731 0 27.6122 0C34.4382 0 39.9605 5.53997 39.9605 12.3111Z" fill="#F79E1B" />
                        </g>
                        <defs>
                            <clipPath id="clip0_108_647">
                                <rect width="40" height="31" fill="white" />
                            </clipPath>
                        </defs>
                    </svg>

                    <svg class="pay-icon" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M4.6665 7.99967L9.33317 3.33301M4.6665 11.9997L9.33317 16.6663H4.6665V3.33301H28.6665V16.6663H17.9998M28.6665 7.99967L23.9998 3.33301M28.6665 11.9997L23.9998 16.6663M3.99984 31.333L11.3332 27.333H20.6665L27.9998 23.333L27.3332 21.333L20.6665 22.6663L11.9998 21.9997L14.6665 18.6663L13.9998 16.6663L7.33317 20.6663L3.99984 24.6663L0.666504 25.9997" stroke="#898989" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round" />
                        <path d="M17.9998 7.33333H15.3332L14.6665 8.66667L15.3332 10H17.9998L18.6665 11.3333L17.9998 12.6667H15.3332M16.6665 7.33333V6M16.6665 14V12.6667" stroke="#60D669" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round" />
                    </svg>
                </div>
            </div>
        </div>
    </div>
    <div class="footer__bottom">
        <div class="footer__bottom-container container">
            <p>Используя формы обратной связи на сайте, вы соглашаетесь <br>с правилами обработки персональных данных.</p>
            <p>Информация на сайте носит исключительно информационный характер и ни при каких <br>условиях не является публичной офертой, определяемой положением Статьи 437 ГК РФ.</p>
        </div>
    </div>
</footer>

<?php wp_footer(); ?>
</body>

</html>